src/Documents/РезультатыТендера/РезультатыТендера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыТендера</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТендера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПредметаСнабжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Победитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеПоставки</name>
    <type>
      <types>CatalogRef.УсловияПоставок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/РезультатыТендера/ObjectModule.bsl
//////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЕстьДублиЦен()
	Результат 				= Ложь;
	ДублиПредметовСнабжения = Новый Соответствие;
	
	ТаблицаПроверкиЦен 		= Цены.Выгрузить();
	ТаблицаПроверкиЦен.Колонки.Добавить("КоличествоПоставщиков");
	ТаблицаПроверкиЦен.ЗаполнитьЗначения(1, "КоличествоПоставщиков");
	ТаблицаПроверкиЦен.Свернуть("ПредметСнабжения,Поставщик,Количество", "КоличествоПоставщиков");
	
	Для Каждого СтрокаТаблицы Из ТаблицаПроверкиЦен Цикл
		Если СтрокаТаблицы.КоличествоПоставщиков > 1 Тогда
			ДублиПредметовСнабжения.Вставить(СтрокаТаблицы.ПредметСнабжения);
		КонецЕсли; // Если СтрокаТаблицы.Количество > 1 Тогда		
	КонецЦикла; // Для Каждого СтрокаТаблицы Из ТаблицаПроверкиЦен Цикл	
	
	Для Каждого Дубль Из ДублиПредметовСнабжения Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предмет снабжения [" + Дубль.Ключ + "] дублируется!");
		Результат 			= Истина;
	КонецЦикла; // Для Каждого Дубль Из ДублиПредметовСнабжения Цикл	
	
	Возврат Результат;
КонецФункции // ПроверкаДублейЦен

Функция ЕстьОшибки()
	Результат = Ложь;
	
	// Валюта
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана валюта!", ЭтотОбъект, "Валюта");
		Результат = Истина;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Валюта) Тогда	
	
	// Проверка заполнения в табличной части "Цены"
	Для Каждого СтрокаТаблицы Из Цены Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ПредметСнабжения) Тогда
			Результат = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Есть строки с незаполненными предметами снабжения!");
			Возврат Результат;
		КонецЕсли; // Если Не ЗначениеЗаполнено(СтрокаТаблицы.ПредметСнабжения) Тогда
		
	КонецЦикла; // Для Каждого СтрокаТаблицы Из Цены Цикл
	
	
	// Проверка на дубли в табличной части "Цены"
	Если ЕстьДублиЦен() Тогда
		Результат = Истина;
	КонецЕсли; // Если ЕстьДублиЦен() Тогда	
	
	Возврат Результат;
КонецФункции // ЕстьОшибки

//////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	                                          
	Если ЕстьОшибки() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; // Если ЕстьОшибки() Тогда
	
	// РС Цены
	ТаблицаДвижений = Документы.РезультатыТендера.ПолучитьТаблицуДвиженийЦены(Ссылка);
	Движения.Цены.Загрузить(ТаблицаДвижений);
КонецПроцедуры // ОбработкаПроведения
